Revit 2027 API
ComputationDataFor3DPathSet.CreateFromCurves Method
 Creates a new instance of the ComputationDataFor3DPathSet class from the provided curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ComputationDataFor3DPathSet CreateFromCurves(
	IList<Curve> curves
)
Public Shared Function CreateFromCurves (
	curves As IList(Of Curve)
) As ComputationDataFor3DPathSet
public:
static ComputationDataFor3DPathSet^ CreateFromCurves(
	IList<Curve^>^ curves
)
static member CreateFromCurves :
        curves : IList<Curve> -> ComputationDataFor3DPathSet
Parameters
curves IList<Curve>
 The curves that define the 3D path set. The curves must be coplanar and continuous.
Return Value
ComputationDataFor3DPathSet
 Returns a new instance of the ComputationDataFor3DPathSet class.
Exceptions
Exception | Condition
ArgumentException |  curves are not continuous. They do not form a valid curve loop. -or- The curves are not coplanar.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace